/**
 * 全域配置檔案
 */
window.APP_CONFIG = Object.assign(window.APP_CONFIG || {}, {
    // Google Apps Script API URL
    API_URL: 'https://script.google.com/macros/s/AKfycbzqqYUmvm8KFjx_2dDcfuBc2s5DQVnLk5zGVPij45vlYeZw2zVz4nMu13vyIhxldFDq/exec',
    
    // 資料版本 (供快取控管)
    DATA_VERSION: '202605151515'
});

window.STATES_CONFIG = {
    combat: {
        '對戰環境': {
            '對宿敵': false,
            '國戰攻城': false,
            '國戰守城': false,
            '兵力小於對手': false,
            '我方有不良狀態': false,
            '敵方有不良狀態': false
        }
    },
    range: {
        30: {
            // 英雄
            '萬箭': 0, '武聖': 0, '無雙': 0, '離間': 0, '落雷': 0, '傾國': 0, '鼓舞': 0, '奇策': 0,
            '乾坤': 0, '金剛': 0, '悲歌': 0, '亂舞': 0, '業火': 0, '天命': 0, '福佑': 0, '巨象': 0,
            '攻心': 0, '衝陣': 0, '死鬥': 0, '槍王': 0, '幻術': 0, '龍怒': 0, '冰河': 0, '勾魂': 0,
            '聖甲': 0, '障毒': 0, '霸君': 0, '仙音': 0, '兩儀': 0, '四象': 0,
            // 步兵
            '盾牆': 0, '激戰': 0, '堅守': 0, '衝鋒': 0, '反擊': 0, '裂甲': 0, '陷陣': 0, '蓄勢': 0,
            '逆刃': 0, '警覺': 0, '投戟': 0, '戰壕': 0,
            // 騎兵
            '鐵蹄': 0, '奔襲': 0, '不屈': 0, '突擊': 0, '捨身': 0, '剛毅': 0, '合圍': 0, '切割': 0,
            '戮塵': 0, '騎胄': 0, '擲矛': 0, '逸跡': 0,
            // 方士
            '罡氣': 0, '蝕甲': 0, '疾風': 0, '地刺': 0, '咒印': 0, '鬼影': 0, '神光': 0, '血瞳': 0,
            '星隕': 0, '石膚': 0, '陷阱': 0,
            // 弓兵
            '強弩': 0, '閃避': 0, '回射': 0, '火箭': 0, '金汁': 0, '齊射': 0, '輪射': 0, '破空': 0,
            '焱雨': 0, '掩蔽': 0, '落月': 0,
            // 輔助
            '策略': 0, '暴烈': 0, '軍略': 0, '誘敵': 0, '增員': 0, '擴編': 0, '剛體': 0, '靈敏': 0,
            '狂骨': 0, '博聞': 0, '仁義': 0, '推演': 0, '殺意': 0, '株連': 0, '集智': 0, '退避': 0,
            '急救': 0, '無懈': 0, '遁甲': 0, '洞鑒': 0, '凶煞': 0, '折衝': 0, '重生': 0, '鷹視': 0,
            '復仇': 0, '細作': 0,
        },
        20: {
            // 內政
            '築城': 0, '行軍': 0, '富豪': 0, '農耕': 0, '尋礦': 0, '育林': 0, '口才': 0, '豪傑': 0, '商賈': 0,
            '統御類技能數量': 0
        },
        180: {
            '陣法等級總數': 0
        },
        11: {
            '勇武': 0, '才學': 0, '兵法': 0, '修養': 0, '騎兵高級技能數量': 0
        },
        100: {
            '兵力比例': 100
        }
    }
};
